ir_version: 7
producer_name: "pytorch"
producer_version: "2.0.1"
graph {
  node {
    input: "state_encoder.conv1.bias"
    output: "state_encoder.conv2.bias"
    name: "Identity_0"
    op_type: "Identity"
  }
  node {
    input: "x_dict"
    output: "/state_encoder/conv1/Shape_output_0"
    name: "/state_encoder/conv1/Shape"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv1/Constant_output_0"
    name: "/state_encoder/conv1/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv1/Constant_1_output_0"
    name: "/state_encoder/conv1/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\376\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv1/Constant_2_output_0"
    name: "/state_encoder/conv1/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Shape_output_0"
    input: "/state_encoder/conv1/Constant_1_output_0"
    input: "/state_encoder/conv1/Constant_2_output_0"
    input: "/state_encoder/conv1/Constant_output_0"
    output: "/state_encoder/conv1/Slice_output_0"
    name: "/state_encoder/conv1/Slice"
    op_type: "Slice"
  }
  node {
    output: "/state_encoder/conv1/Constant_3_output_0"
    name: "/state_encoder/conv1/Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Slice_output_0"
    input: "/state_encoder/conv1/Constant_3_output_0"
    output: "/state_encoder/conv1/Squeeze_output_0"
    name: "/state_encoder/conv1/Squeeze"
    op_type: "Squeeze"
  }
  node {
    output: "/state_encoder/conv1/Constant_4_output_0"
    name: "/state_encoder/conv1/Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "edge_attr_dict"
    output: "/state_encoder/conv1/Shape_1_output_0"
    name: "/state_encoder/conv1/Shape_1"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv1/Constant_5_output_0"
    name: "/state_encoder/conv1/Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Shape_1_output_0"
    input: "/state_encoder/conv1/Constant_5_output_0"
    output: "/state_encoder/conv1/Gather_output_0"
    name: "/state_encoder/conv1/Gather"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "onnx::Unsqueeze_46"
    name: "Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Gather_output_0"
    input: "onnx::Unsqueeze_46"
    output: "/state_encoder/conv1/Unsqueeze_output_0"
    name: "/state_encoder/conv1/Unsqueeze"
    op_type: "Unsqueeze"
  }
  node {
    input: "/state_encoder/conv1/Unsqueeze_output_0"
    output: "/state_encoder/conv1/Concat_output_0"
    name: "/state_encoder/conv1/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/Concat_output_0"
    output: "/state_encoder/conv1/ConstantOfShape_output_0"
    name: "/state_encoder/conv1/ConstantOfShape"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\200?"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv1/Constant_6_output_0"
    name: "/state_encoder/conv1/Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "edge_attr_dict"
    input: "/state_encoder/conv1/Constant_6_output_0"
    output: "/state_encoder/conv1/Gather_1_output_0"
    name: "/state_encoder/conv1/Gather_1"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "edge_attr_dict"
    input: "/state_encoder/conv1/Constant_4_output_0"
    output: "/state_encoder/conv1/Gather_2_output_0"
    name: "/state_encoder/conv1/Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv1/Constant_7_output_0"
    name: "/state_encoder/conv1/Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Gather_2_output_0"
    input: "/state_encoder/conv1/Constant_7_output_0"
    output: "/state_encoder/conv1/Reshape_output_0"
    name: "/state_encoder/conv1/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/ConstantOfShape_output_0"
    output: "/state_encoder/conv1/Shape_2_output_0"
    name: "/state_encoder/conv1/Shape_2"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv1/Reshape_output_0"
    input: "/state_encoder/conv1/Shape_2_output_0"
    output: "/state_encoder/conv1/Expand_output_0"
    name: "/state_encoder/conv1/Expand"
    op_type: "Expand"
  }
  node {
    output: "onnx::Unsqueeze_57"
    name: "Constant_23"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Squeeze_output_0"
    input: "onnx::Unsqueeze_57"
    output: "/state_encoder/conv1/Unsqueeze_1_output_0"
    name: "/state_encoder/conv1/Unsqueeze_1"
    op_type: "Unsqueeze"
  }
  node {
    input: "/state_encoder/conv1/Unsqueeze_1_output_0"
    output: "/state_encoder/conv1/Concat_1_output_0"
    name: "/state_encoder/conv1/Concat_1"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/Concat_1_output_0"
    output: "/state_encoder/conv1/ConstantOfShape_1_output_0"
    name: "/state_encoder/conv1/ConstantOfShape_1"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/ConstantOfShape_1_output_0"
    output: "/state_encoder/conv1/Shape_3_output_0"
    name: "/state_encoder/conv1/Shape_3"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv1/Shape_3_output_0"
    output: "/state_encoder/conv1/ConstantOfShape_2_output_0"
    name: "/state_encoder/conv1/ConstantOfShape_2"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/ConstantOfShape_2_output_0"
    input: "/state_encoder/conv1/Expand_output_0"
    input: "/state_encoder/conv1/ConstantOfShape_output_0"
    output: "/state_encoder/conv1/ScatterElements_output_0"
    name: "/state_encoder/conv1/ScatterElements"
    op_type: "ScatterElements"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/ConstantOfShape_1_output_0"
    input: "/state_encoder/conv1/ScatterElements_output_0"
    output: "/state_encoder/conv1/Add_output_0"
    name: "/state_encoder/conv1/Add"
    op_type: "Add"
  }
  node {
    output: "/state_encoder/conv1/Constant_8_output_0"
    name: "/state_encoder/conv1/Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000\277"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Add_output_0"
    input: "/state_encoder/conv1/Constant_8_output_0"
    output: "/state_encoder/conv1/Pow_output_0"
    name: "/state_encoder/conv1/Pow"
    op_type: "Pow"
  }
  node {
    output: "/state_encoder/conv1/Constant_9_output_0"
    name: "/state_encoder/conv1/Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200\177"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Pow_output_0"
    input: "/state_encoder/conv1/Constant_9_output_0"
    output: "/state_encoder/conv1/Equal_output_0"
    name: "/state_encoder/conv1/Equal"
    op_type: "Equal"
  }
  node {
    input: "/state_encoder/conv1/Equal_output_0"
    output: "/state_encoder/conv1/Cast_output_0"
    name: "/state_encoder/conv1/Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv1/Constant_10_output_0"
    name: "/state_encoder/conv1/Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Cast_output_0"
    input: "/state_encoder/conv1/Constant_10_output_0"
    input: "/state_encoder/conv1/Pow_output_0"
    output: "/state_encoder/conv1/Where_output_0"
    name: "/state_encoder/conv1/Where"
    op_type: "Where"
  }
  node {
    input: "/state_encoder/conv1/Where_output_0"
    input: "/state_encoder/conv1/Gather_1_output_0"
    output: "/state_encoder/conv1/Gather_3_output_0"
    name: "/state_encoder/conv1/Gather_3"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/Gather_3_output_0"
    input: "/state_encoder/conv1/ConstantOfShape_output_0"
    output: "/state_encoder/conv1/Mul_output_0"
    name: "/state_encoder/conv1/Mul"
    op_type: "Mul"
  }
  node {
    input: "/state_encoder/conv1/Where_output_0"
    input: "/state_encoder/conv1/Gather_2_output_0"
    output: "/state_encoder/conv1/Gather_4_output_0"
    name: "/state_encoder/conv1/Gather_4"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/Mul_output_0"
    input: "/state_encoder/conv1/Gather_4_output_0"
    output: "/state_encoder/conv1/Mul_1_output_0"
    name: "/state_encoder/conv1/Mul_1"
    op_type: "Mul"
  }
  node {
    input: "x_dict"
    input: "onnx::MatMul_430"
    output: "/state_encoder/conv1/lins.0/MatMul_output_0"
    name: "/state_encoder/conv1/lins.0/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "edge_attr_dict"
    input: "/state_encoder/conv1/Constant_6_output_0"
    output: "/state_encoder/conv1/Gather_5_output_0"
    name: "/state_encoder/conv1/Gather_5"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "x_dict"
    input: "/state_encoder/conv1/Gather_5_output_0"
    output: "/state_encoder/conv1/Gather_6_output_0"
    name: "/state_encoder/conv1/Gather_6"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: -2
      type: INT
    }
  }
  node {
    input: "edge_attr_dict"
    input: "/state_encoder/conv1/Constant_4_output_0"
    output: "/state_encoder/conv1/Gather_7_output_0"
    name: "/state_encoder/conv1/Gather_7"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv1/Constant_11_output_0"
    name: "/state_encoder/conv1/Constant_11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Mul_1_output_0"
    input: "/state_encoder/conv1/Constant_11_output_0"
    output: "/state_encoder/conv1/Reshape_1_output_0"
    name: "/state_encoder/conv1/Reshape_1"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/Reshape_1_output_0"
    input: "/state_encoder/conv1/Gather_6_output_0"
    output: "/state_encoder/conv1/Mul_2_output_0"
    name: "/state_encoder/conv1/Mul_2"
    op_type: "Mul"
  }
  node {
    input: "/state_encoder/conv1/Mul_2_output_0"
    output: "/state_encoder/conv1/aggr_module/Shape_output_0"
    name: "/state_encoder/conv1/aggr_module/Shape"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv1/aggr_module/Constant_output_0"
    name: "/state_encoder/conv1/aggr_module/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Shape_output_0"
    input: "/state_encoder/conv1/aggr_module/Constant_output_0"
    output: "/state_encoder/conv1/aggr_module/Gather_output_0"
    name: "/state_encoder/conv1/aggr_module/Gather"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv1/aggr_module/Constant_1_output_0"
    name: "/state_encoder/conv1/aggr_module/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Gather_7_output_0"
    input: "/state_encoder/conv1/aggr_module/Constant_1_output_0"
    output: "/state_encoder/conv1/aggr_module/Reshape_output_0"
    name: "/state_encoder/conv1/aggr_module/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/Mul_2_output_0"
    output: "/state_encoder/conv1/aggr_module/Shape_1_output_0"
    name: "/state_encoder/conv1/aggr_module/Shape_1"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Reshape_output_0"
    input: "/state_encoder/conv1/aggr_module/Shape_1_output_0"
    output: "/state_encoder/conv1/aggr_module/Expand_output_0"
    name: "/state_encoder/conv1/aggr_module/Expand"
    op_type: "Expand"
  }
  node {
    output: "onnx::Unsqueeze_91"
    name: "Constant_56"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Squeeze_output_0"
    input: "onnx::Unsqueeze_91"
    output: "/state_encoder/conv1/aggr_module/Unsqueeze_output_0"
    name: "/state_encoder/conv1/aggr_module/Unsqueeze"
    op_type: "Unsqueeze"
  }
  node {
    output: "onnx::Unsqueeze_93"
    name: "Constant_58"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Gather_output_0"
    input: "onnx::Unsqueeze_93"
    output: "/state_encoder/conv1/aggr_module/Unsqueeze_1_output_0"
    name: "/state_encoder/conv1/aggr_module/Unsqueeze_1"
    op_type: "Unsqueeze"
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Unsqueeze_output_0"
    input: "/state_encoder/conv1/aggr_module/Unsqueeze_1_output_0"
    output: "/state_encoder/conv1/aggr_module/Concat_output_0"
    name: "/state_encoder/conv1/aggr_module/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Concat_output_0"
    output: "/state_encoder/conv1/aggr_module/ConstantOfShape_output_0"
    name: "/state_encoder/conv1/aggr_module/ConstantOfShape"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module/ConstantOfShape_output_0"
    output: "/state_encoder/conv1/aggr_module/Shape_2_output_0"
    name: "/state_encoder/conv1/aggr_module/Shape_2"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Shape_2_output_0"
    output: "/state_encoder/conv1/aggr_module/ConstantOfShape_1_output_0"
    name: "/state_encoder/conv1/aggr_module/ConstantOfShape_1"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module/ConstantOfShape_1_output_0"
    input: "/state_encoder/conv1/aggr_module/Expand_output_0"
    input: "/state_encoder/conv1/Mul_2_output_0"
    output: "/state_encoder/conv1/aggr_module/ScatterElements_output_0"
    name: "/state_encoder/conv1/aggr_module/ScatterElements"
    op_type: "ScatterElements"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module/ConstantOfShape_output_0"
    input: "/state_encoder/conv1/aggr_module/ScatterElements_output_0"
    output: "/state_encoder/conv1/aggr_module/Add_output_0"
    name: "/state_encoder/conv1/aggr_module/Add"
    op_type: "Add"
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Add_output_0"
    input: "onnx::MatMul_431"
    output: "/state_encoder/conv1/MatMul_output_0"
    name: "/state_encoder/conv1/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/state_encoder/conv1/lins.0/MatMul_output_0"
    input: "/state_encoder/conv1/MatMul_output_0"
    output: "/state_encoder/conv1/Add_1_output_0"
    name: "/state_encoder/conv1/Add_1"
    op_type: "Add"
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Add_output_0"
    output: "/state_encoder/conv1/Shape_4_output_0"
    name: "/state_encoder/conv1/Shape_4"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv1/Constant_12_output_0"
    name: "/state_encoder/conv1/Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv1/Constant_13_output_0"
    name: "/state_encoder/conv1/Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\376\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv1/Constant_14_output_0"
    name: "/state_encoder/conv1/Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Shape_4_output_0"
    input: "/state_encoder/conv1/Constant_13_output_0"
    input: "/state_encoder/conv1/Constant_14_output_0"
    input: "/state_encoder/conv1/Constant_12_output_0"
    output: "/state_encoder/conv1/Slice_1_output_0"
    name: "/state_encoder/conv1/Slice_1"
    op_type: "Slice"
  }
  node {
    output: "/state_encoder/conv1/Constant_15_output_0"
    name: "/state_encoder/conv1/Constant_15"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Slice_1_output_0"
    input: "/state_encoder/conv1/Constant_15_output_0"
    output: "/state_encoder/conv1/Squeeze_1_output_0"
    name: "/state_encoder/conv1/Squeeze_1"
    op_type: "Squeeze"
  }
  node {
    input: "edge_attr_dict"
    input: "/state_encoder/conv1/Constant_6_output_0"
    output: "/state_encoder/conv1/Gather_8_output_0"
    name: "/state_encoder/conv1/Gather_8"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module/Add_output_0"
    input: "/state_encoder/conv1/Gather_8_output_0"
    output: "/state_encoder/conv1/Gather_9_output_0"
    name: "/state_encoder/conv1/Gather_9"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: -2
      type: INT
    }
  }
  node {
    input: "edge_attr_dict"
    input: "/state_encoder/conv1/Constant_4_output_0"
    output: "/state_encoder/conv1/Gather_10_output_0"
    name: "/state_encoder/conv1/Gather_10"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/Reshape_1_output_0"
    input: "/state_encoder/conv1/Gather_9_output_0"
    output: "/state_encoder/conv1/Mul_3_output_0"
    name: "/state_encoder/conv1/Mul_3"
    op_type: "Mul"
  }
  node {
    input: "/state_encoder/conv1/Mul_3_output_0"
    output: "/state_encoder/conv1/aggr_module_1/Shape_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Shape"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv1/aggr_module_1/Constant_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/Shape_output_0"
    input: "/state_encoder/conv1/aggr_module_1/Constant_output_0"
    output: "/state_encoder/conv1/aggr_module_1/Gather_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Gather"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv1/aggr_module_1/Constant_1_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Gather_10_output_0"
    input: "/state_encoder/conv1/aggr_module_1/Constant_1_output_0"
    output: "/state_encoder/conv1/aggr_module_1/Reshape_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/Mul_3_output_0"
    output: "/state_encoder/conv1/aggr_module_1/Shape_1_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Shape_1"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/Reshape_output_0"
    input: "/state_encoder/conv1/aggr_module_1/Shape_1_output_0"
    output: "/state_encoder/conv1/aggr_module_1/Expand_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Expand"
    op_type: "Expand"
  }
  node {
    output: "onnx::Unsqueeze_122"
    name: "Constant_86"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/Squeeze_1_output_0"
    input: "onnx::Unsqueeze_122"
    output: "/state_encoder/conv1/aggr_module_1/Unsqueeze_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Unsqueeze"
    op_type: "Unsqueeze"
  }
  node {
    output: "onnx::Unsqueeze_124"
    name: "Constant_88"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/Gather_output_0"
    input: "onnx::Unsqueeze_124"
    output: "/state_encoder/conv1/aggr_module_1/Unsqueeze_1_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Unsqueeze_1"
    op_type: "Unsqueeze"
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/Unsqueeze_output_0"
    input: "/state_encoder/conv1/aggr_module_1/Unsqueeze_1_output_0"
    output: "/state_encoder/conv1/aggr_module_1/Concat_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/Concat_output_0"
    output: "/state_encoder/conv1/aggr_module_1/ConstantOfShape_output_0"
    name: "/state_encoder/conv1/aggr_module_1/ConstantOfShape"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/ConstantOfShape_output_0"
    output: "/state_encoder/conv1/aggr_module_1/Shape_2_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Shape_2"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/Shape_2_output_0"
    output: "/state_encoder/conv1/aggr_module_1/ConstantOfShape_1_output_0"
    name: "/state_encoder/conv1/aggr_module_1/ConstantOfShape_1"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/ConstantOfShape_1_output_0"
    input: "/state_encoder/conv1/aggr_module_1/Expand_output_0"
    input: "/state_encoder/conv1/Mul_3_output_0"
    output: "/state_encoder/conv1/aggr_module_1/ScatterElements_output_0"
    name: "/state_encoder/conv1/aggr_module_1/ScatterElements"
    op_type: "ScatterElements"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/ConstantOfShape_output_0"
    input: "/state_encoder/conv1/aggr_module_1/ScatterElements_output_0"
    output: "/state_encoder/conv1/aggr_module_1/Add_output_0"
    name: "/state_encoder/conv1/aggr_module_1/Add"
    op_type: "Add"
  }
  node {
    input: "/state_encoder/conv1/aggr_module_1/Add_output_0"
    input: "onnx::MatMul_432"
    output: "/state_encoder/conv1/MatMul_1_output_0"
    name: "/state_encoder/conv1/MatMul_1"
    op_type: "MatMul"
  }
  node {
    input: "/state_encoder/conv1/Add_1_output_0"
    input: "/state_encoder/conv1/MatMul_1_output_0"
    output: "/state_encoder/conv1/Add_2_output_0"
    name: "/state_encoder/conv1/Add_2"
    op_type: "Add"
  }
  node {
    input: "/state_encoder/conv1/Add_2_output_0"
    input: "state_encoder.conv1.bias"
    output: "/state_encoder/conv1/Add_3_output_0"
    name: "/state_encoder/conv1/Add_3"
    op_type: "Add"
  }
  node {
    input: "/state_encoder/conv1/Add_3_output_0"
    output: "/state_encoder/Relu_output_0"
    name: "/state_encoder/Relu"
    op_type: "Relu"
  }
  node {
    input: "edge_index_dict"
    output: "/state_encoder/conv2/Shape_output_0"
    name: "/state_encoder/conv2/Shape"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv2/Constant_output_0"
    name: "/state_encoder/conv2/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_1_output_0"
    name: "/state_encoder/conv2/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\376\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_2_output_0"
    name: "/state_encoder/conv2/Constant_2"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Shape_output_0"
    input: "/state_encoder/conv2/Constant_1_output_0"
    input: "/state_encoder/conv2/Constant_2_output_0"
    input: "/state_encoder/conv2/Constant_output_0"
    output: "/state_encoder/conv2/Slice_output_0"
    name: "/state_encoder/conv2/Slice"
    op_type: "Slice"
  }
  node {
    output: "/state_encoder/conv2/Constant_3_output_0"
    name: "/state_encoder/conv2/Constant_3"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Slice_output_0"
    input: "/state_encoder/conv2/Constant_3_output_0"
    output: "/state_encoder/conv2/Squeeze_output_0"
    name: "/state_encoder/conv2/Squeeze"
    op_type: "Squeeze"
  }
  node {
    output: "/state_encoder/conv2/Constant_4_output_0"
    name: "/state_encoder/conv2/Constant_4"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
        raw_data: ""
      }
      type: TENSOR
    }
  }
  node {
    input: "edge_index.3"
    input: "/state_encoder/conv1/Constant_6_output_0"
    output: "/state_encoder/conv2/Gather_output_0"
    name: "/state_encoder/conv2/Gather"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "edge_index.3"
    input: "/state_encoder/conv1/Constant_4_output_0"
    output: "/state_encoder/conv2/Gather_1_output_0"
    name: "/state_encoder/conv2/Gather_1"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_5_output_0"
    name: "/state_encoder/conv2/Constant_5"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Gather_1_output_0"
    input: "/state_encoder/conv2/Constant_5_output_0"
    output: "/state_encoder/conv2/Reshape_output_0"
    name: "/state_encoder/conv2/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_6_output_0"
    name: "/state_encoder/conv2/Constant_6"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Reshape_output_0"
    input: "/state_encoder/conv2/Constant_6_output_0"
    output: "/state_encoder/conv2/Expand_output_0"
    name: "/state_encoder/conv2/Expand"
    op_type: "Expand"
  }
  node {
    output: "onnx::Unsqueeze_151"
    name: "Constant_114"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Squeeze_output_0"
    input: "onnx::Unsqueeze_151"
    output: "/state_encoder/conv2/Unsqueeze_output_0"
    name: "/state_encoder/conv2/Unsqueeze"
    op_type: "Unsqueeze"
  }
  node {
    input: "/state_encoder/conv2/Unsqueeze_output_0"
    output: "/state_encoder/conv2/Concat_output_0"
    name: "/state_encoder/conv2/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/Concat_output_0"
    output: "/state_encoder/conv2/ConstantOfShape_output_0"
    name: "/state_encoder/conv2/ConstantOfShape"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/ConstantOfShape_output_0"
    output: "/state_encoder/conv2/Shape_1_output_0"
    name: "/state_encoder/conv2/Shape_1"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv2/Shape_1_output_0"
    output: "/state_encoder/conv2/ConstantOfShape_1_output_0"
    name: "/state_encoder/conv2/ConstantOfShape_1"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/ConstantOfShape_1_output_0"
    input: "/state_encoder/conv2/Expand_output_0"
    input: "/state_encoder/conv2/Constant_4_output_0"
    output: "/state_encoder/conv2/ScatterElements_output_0"
    name: "/state_encoder/conv2/ScatterElements"
    op_type: "ScatterElements"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/ConstantOfShape_output_0"
    input: "/state_encoder/conv2/ScatterElements_output_0"
    output: "/state_encoder/conv2/Add_output_0"
    name: "/state_encoder/conv2/Add"
    op_type: "Add"
  }
  node {
    output: "/state_encoder/conv2/Constant_7_output_0"
    name: "/state_encoder/conv2/Constant_7"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000\277"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Add_output_0"
    input: "/state_encoder/conv2/Constant_7_output_0"
    output: "/state_encoder/conv2/Pow_output_0"
    name: "/state_encoder/conv2/Pow"
    op_type: "Pow"
  }
  node {
    output: "/state_encoder/conv2/Constant_8_output_0"
    name: "/state_encoder/conv2/Constant_8"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\200\177"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Pow_output_0"
    input: "/state_encoder/conv2/Constant_8_output_0"
    output: "/state_encoder/conv2/Equal_output_0"
    name: "/state_encoder/conv2/Equal"
    op_type: "Equal"
  }
  node {
    input: "/state_encoder/conv2/Equal_output_0"
    output: "/state_encoder/conv2/Cast_output_0"
    name: "/state_encoder/conv2/Cast"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 9
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_9_output_0"
    name: "/state_encoder/conv2/Constant_9"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Cast_output_0"
    input: "/state_encoder/conv2/Constant_9_output_0"
    input: "/state_encoder/conv2/Pow_output_0"
    output: "/state_encoder/conv2/Where_output_0"
    name: "/state_encoder/conv2/Where"
    op_type: "Where"
  }
  node {
    input: "/state_encoder/conv2/Where_output_0"
    input: "/state_encoder/conv2/Gather_output_0"
    output: "/state_encoder/conv2/Gather_2_output_0"
    name: "/state_encoder/conv2/Gather_2"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_10_output_0"
    name: "/state_encoder/conv2/Constant_10"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 0
        data_type: 1
        raw_data: ""
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Gather_2_output_0"
    input: "/state_encoder/conv2/Constant_10_output_0"
    output: "/state_encoder/conv2/Mul_output_0"
    name: "/state_encoder/conv2/Mul"
    op_type: "Mul"
  }
  node {
    input: "/state_encoder/conv2/Where_output_0"
    input: "/state_encoder/conv2/Gather_1_output_0"
    output: "/state_encoder/conv2/Gather_3_output_0"
    name: "/state_encoder/conv2/Gather_3"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/Mul_output_0"
    input: "/state_encoder/conv2/Gather_3_output_0"
    output: "/state_encoder/conv2/Mul_1_output_0"
    name: "/state_encoder/conv2/Mul_1"
    op_type: "Mul"
  }
  node {
    input: "edge_index_dict"
    input: "onnx::MatMul_434"
    output: "/state_encoder/conv2/lins.0/MatMul_output_0"
    name: "/state_encoder/conv2/lins.0/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "edge_index.3"
    input: "/state_encoder/conv1/Constant_6_output_0"
    output: "/state_encoder/conv2/Gather_4_output_0"
    name: "/state_encoder/conv2/Gather_4"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "edge_index_dict"
    input: "/state_encoder/conv2/Gather_4_output_0"
    output: "/state_encoder/conv2/Gather_5_output_0"
    name: "/state_encoder/conv2/Gather_5"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: -2
      type: INT
    }
  }
  node {
    input: "edge_index.3"
    input: "/state_encoder/conv1/Constant_4_output_0"
    output: "/state_encoder/conv2/Gather_6_output_0"
    name: "/state_encoder/conv2/Gather_6"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_11_output_0"
    name: "/state_encoder/conv2/Constant_11"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Mul_1_output_0"
    input: "/state_encoder/conv2/Constant_11_output_0"
    output: "/state_encoder/conv2/Reshape_1_output_0"
    name: "/state_encoder/conv2/Reshape_1"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/Reshape_1_output_0"
    input: "/state_encoder/conv2/Gather_5_output_0"
    output: "/state_encoder/conv2/Mul_2_output_0"
    name: "/state_encoder/conv2/Mul_2"
    op_type: "Mul"
  }
  node {
    input: "/state_encoder/conv2/Mul_2_output_0"
    output: "/state_encoder/conv2/aggr_module/Shape_output_0"
    name: "/state_encoder/conv2/aggr_module/Shape"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv2/aggr_module/Constant_output_0"
    name: "/state_encoder/conv2/aggr_module/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Shape_output_0"
    input: "/state_encoder/conv2/aggr_module/Constant_output_0"
    output: "/state_encoder/conv2/aggr_module/Gather_output_0"
    name: "/state_encoder/conv2/aggr_module/Gather"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv2/aggr_module/Constant_1_output_0"
    name: "/state_encoder/conv2/aggr_module/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Gather_6_output_0"
    input: "/state_encoder/conv2/aggr_module/Constant_1_output_0"
    output: "/state_encoder/conv2/aggr_module/Reshape_output_0"
    name: "/state_encoder/conv2/aggr_module/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/Mul_2_output_0"
    output: "/state_encoder/conv2/aggr_module/Shape_1_output_0"
    name: "/state_encoder/conv2/aggr_module/Shape_1"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Reshape_output_0"
    input: "/state_encoder/conv2/aggr_module/Shape_1_output_0"
    output: "/state_encoder/conv2/aggr_module/Expand_output_0"
    name: "/state_encoder/conv2/aggr_module/Expand"
    op_type: "Expand"
  }
  node {
    output: "onnx::Unsqueeze_186"
    name: "Constant_148"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Squeeze_output_0"
    input: "onnx::Unsqueeze_186"
    output: "/state_encoder/conv2/aggr_module/Unsqueeze_output_0"
    name: "/state_encoder/conv2/aggr_module/Unsqueeze"
    op_type: "Unsqueeze"
  }
  node {
    output: "onnx::Unsqueeze_188"
    name: "Constant_150"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Gather_output_0"
    input: "onnx::Unsqueeze_188"
    output: "/state_encoder/conv2/aggr_module/Unsqueeze_1_output_0"
    name: "/state_encoder/conv2/aggr_module/Unsqueeze_1"
    op_type: "Unsqueeze"
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Unsqueeze_output_0"
    input: "/state_encoder/conv2/aggr_module/Unsqueeze_1_output_0"
    output: "/state_encoder/conv2/aggr_module/Concat_output_0"
    name: "/state_encoder/conv2/aggr_module/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Concat_output_0"
    output: "/state_encoder/conv2/aggr_module/ConstantOfShape_output_0"
    name: "/state_encoder/conv2/aggr_module/ConstantOfShape"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/aggr_module/ConstantOfShape_output_0"
    output: "/state_encoder/conv2/aggr_module/Shape_2_output_0"
    name: "/state_encoder/conv2/aggr_module/Shape_2"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Shape_2_output_0"
    output: "/state_encoder/conv2/aggr_module/ConstantOfShape_1_output_0"
    name: "/state_encoder/conv2/aggr_module/ConstantOfShape_1"
    op_type: "ConstantOfShape"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 1
        raw_data: "\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/aggr_module/ConstantOfShape_1_output_0"
    input: "/state_encoder/conv2/aggr_module/Expand_output_0"
    input: "/state_encoder/conv2/Mul_2_output_0"
    output: "/state_encoder/conv2/aggr_module/ScatterElements_output_0"
    name: "/state_encoder/conv2/aggr_module/ScatterElements"
    op_type: "ScatterElements"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/aggr_module/ConstantOfShape_output_0"
    input: "/state_encoder/conv2/aggr_module/ScatterElements_output_0"
    output: "/state_encoder/conv2/aggr_module/Add_output_0"
    name: "/state_encoder/conv2/aggr_module/Add"
    op_type: "Add"
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Add_output_0"
    input: "onnx::MatMul_435"
    output: "/state_encoder/conv2/MatMul_output_0"
    name: "/state_encoder/conv2/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/state_encoder/conv2/lins.0/MatMul_output_0"
    input: "/state_encoder/conv2/MatMul_output_0"
    output: "/state_encoder/conv2/Add_1_output_0"
    name: "/state_encoder/conv2/Add_1"
    op_type: "Add"
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Add_output_0"
    output: "/state_encoder/conv2/Shape_2_output_0"
    name: "/state_encoder/conv2/Shape_2"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv2/Constant_12_output_0"
    name: "/state_encoder/conv2/Constant_12"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_13_output_0"
    name: "/state_encoder/conv2/Constant_13"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\376\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    output: "/state_encoder/conv2/Constant_14_output_0"
    name: "/state_encoder/conv2/Constant_14"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Shape_2_output_0"
    input: "/state_encoder/conv2/Constant_13_output_0"
    input: "/state_encoder/conv2/Constant_14_output_0"
    input: "/state_encoder/conv2/Constant_12_output_0"
    output: "/state_encoder/conv2/Slice_1_output_0"
    name: "/state_encoder/conv2/Slice_1"
    op_type: "Slice"
  }
  node {
    output: "/state_encoder/conv2/Constant_15_output_0"
    name: "/state_encoder/conv2/Constant_15"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Slice_1_output_0"
    input: "/state_encoder/conv2/Constant_15_output_0"
    output: "/state_encoder/conv2/Squeeze_1_output_0"
    name: "/state_encoder/conv2/Squeeze_1"
    op_type: "Squeeze"
  }
  node {
    input: "edge_index.3"
    input: "/state_encoder/conv1/Constant_6_output_0"
    output: "/state_encoder/conv2/Gather_7_output_0"
    name: "/state_encoder/conv2/Gather_7"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/aggr_module/Add_output_0"
    input: "/state_encoder/conv2/Gather_7_output_0"
    output: "/state_encoder/conv2/Gather_8_output_0"
    name: "/state_encoder/conv2/Gather_8"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: -2
      type: INT
    }
  }
  node {
    input: "edge_index.3"
    input: "/state_encoder/conv1/Constant_4_output_0"
    output: "/state_encoder/conv2/Gather_9_output_0"
    name: "/state_encoder/conv2/Gather_9"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/Reshape_1_output_0"
    input: "/state_encoder/conv2/Gather_8_output_0"
    output: "/state_encoder/conv2/Mul_3_output_0"
    name: "/state_encoder/conv2/Mul_3"
    op_type: "Mul"
  }
  node {
    input: "/state_encoder/conv2/Mul_3_output_0"
    output: "/state_encoder/conv2/aggr_module_1/Shape_output_0"
    name: "/state_encoder/conv2/aggr_module_1/Shape"
    op_type: "Shape"
  }
  node {
    output: "/state_encoder/conv2/aggr_module_1/Constant_output_0"
    name: "/state_encoder/conv2/aggr_module_1/Constant"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
        raw_data: "\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/aggr_module_1/Shape_output_0"
    input: "/state_encoder/conv2/aggr_module_1/Constant_output_0"
    output: "/state_encoder/conv2/aggr_module_1/Gather_output_0"
    name: "/state_encoder/conv2/aggr_module_1/Gather"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "/state_encoder/conv2/aggr_module_1/Constant_1_output_0"
    name: "/state_encoder/conv2/aggr_module_1/Constant_1"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 7
        raw_data: "\377\377\377\377\377\377\377\377\001\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
    input: "/state_encoder/conv2/Gather_9_output_0"
    input: "/state_encoder/conv2/aggr_module_1/Constant_1_output_0"
    output: "/state_encoder/conv2/aggr_module_1/Reshape_output_0"
    name: "/state_encoder/conv2/aggr_module_1/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/state_encoder/conv2/Mul_3_output_0"
    output: "/state_encoder/conv2/aggr_module_1/Shape_1_output_0"
    name: "/state_encoder/conv2/aggr_module_1/Shape_1"
    op_type: "Shape"
  }
  node {
    input: "/state_encoder/conv2/aggr_module_1/Reshape_output_0"
    input: "/state_encoder/conv2/aggr_module_1/Shape_1_output_0"
    output: "/state_encoder/conv2/aggr_module_1/Expand_output_0"
    name: "/state_encoder/conv2/aggr_module_1/Expand"
    op_type: "Expand"
  }
  node {
    output: "onnx::Unsqueeze_217"
    name: "Constant_178"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
        raw_data: "\000\000\000\000\000\000\000\000"
      }
      type: TENSOR
    }
  }
  node {
